---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.CurveRoofSkippedLoops
source: html/1fc00d18-231a-ec1c-cf79-d7b10d85bfc9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.CurveRoofSkippedLoops Property

Some loops were skipped

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveRoofSkippedLoops { get; }
```